app/Cells/ArtikelTerkini.php

    public function render(): string
    {
        $model = new ArtikelModel();
        $artikel = $model->orderBy('id', 'DESC')->limit(5)->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5